<!DOCTYPE html PUBLIC "-//IETF//DTD HTML//EN"> <meta http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1"> <meta name="GENERATOR" content="Microsoft FrontPage 3.0"> 
<title>OpenXP Online - Hinweise für Entwickler</title> <p align="center"><font face="Verdana, Arial, Helvetica,
sans-serif" size="+2"><b>OpenXP Hinweise f&uuml;r Entwickler</b></font> <H3>Allgemeines</H3><p>OpenXP 
wird von einem gro&szlig;en Team von Entwicklern (siehe erste Seite) entwickelt. 
Daraus ergibt sich, das jeder Entwickler sich an ein paar Regeln halten mu&szlig;, 
damit die Weiterentwicklung z&uuml;gig ablaufen kann und so wenig wie m&ouml;glich 
Fehlerquellen entstehen.<p>Zur koodinierung des Projektes existiert eine XPDeveloper 
<A HREF="http://mail1.sourceforge.net/mailman/listinfo/openxp-dev">Maillingliste</A>. 
<H3>Den aktuellen Code beziehen</H3><p>Wir verwenden f&uuml;r die Verwaltung des 
Sourcecodes ein Versionsmanagementsystem <A HREF="http://www.cyclic.com">CVS</A>. 
Eine Windows und OS/2-Version des Tools befindet sich auf dem <A HREF="ftp://ftp.openxp.de/openxp/tools">ftp-Server</A>. 
Mit folgenden Befehlen kann der Code bezogen werden:<p><FONT FACE="Courier New, Courier, mono">cvs 
-d :pserver:cvs@fries7-73.stw.uni-jena.de:/usr/local/cvs login</FONT><p>Als Passwort 
mu&szlig;: &quot;cvs&quot; angegeben werden. Der Login ist nur einmal n&ouml;tig, 
da CVS sich das Passwort merkt. Der Pfad nach der Option &quot;-d&quot; kann in 
der Environmentvariable &quot;CVSROOT&quot; abgelegt werden, damit dieser nicht 
bei jedem Kommando mit angegeben werden mu&szlig;. Der Source selbst wird mit<p><FONT FACE="Courier New, Courier, mono">cvs 
checkout openxp</FONT><p>in das Verzeichnis ./openxp abgelegt. Der Checkout erstellt 
eine Working Copy des Codes. Um diese Working Copy auf den aktuellsten Versionsstand 
zu bringen folgendes n&ouml;tig:<p><FONT FACE="Courier New, Courier, mono">cd 
openxp<BR>cvs update</FONT><p>Evtl. schon durchgef&uuml;hrte &Auml;nderungen werden 
dabei nicht &uuml;berschrieben, sondern mit den Neuerungen aus dem CVS Baum gemerget. 
Manchmal ist es n&ouml;tig, eine &auml;ltere Version vom CVS-Server zu ziehen. 
Durch die Option -r wird ein Release Tag angegeben. <p><FONT FACE="Courier New, Courier, mono">cvs 
up -r Beta_3_20_21</FONT><FONT FACE="Courier New, Courier, mono"><BR></FONT>
<P><p><BR>
<p>Mit diesen Befehlen wird entweder Beta 3.20.21 ausgecheckt.
<p>OpenXP hat mittlerweile drei Entwicklerb&auml;ume, den 3.20 (16 Bit DOS), den 
  3.30 (16 Bit DOS) und 3.70 (32 Bit). Diese Entwicklerb&auml;ume sind unabh&auml;ngig 
  voneinander und k&ouml;nnen folgenderma&szlig;en ausgecheckt werden: 
<p><font face="Courier New, Courier, mono">cvs up -r Branch_3_20_Release <br>
  cvs up -r Branch_3_30_Release <br>
  </font>
<p><br>
In der Version 3.20 sind im Prinzip keine &Auml;nderungen mehr erlaubt, au&szlig;er 
notwendige Bugfixes. In den 3.30 und 3.70er B&auml;umen werden jeweils die 16 
und 32 Bit Versionen weiterentwickelt.<br>
<p>Alle weiteren CVS-Befhele sind in der Dokumentation des Programmes bzw. in 
  dem unten stehenden Buch erkl&auml;rt.
<H3>Coding Standard</H3><p>Die Code-Qualit&auml;t 
ist f&uuml;r ein so gro&szlig;es Projekt wie OpenXP von entscheidendet Bedeutung. 
Weiterhin ist auf eine saubere und ausf&uuml;hrliche Dokumentation zu achten. 
&Auml;nderungen, die nicht diesem Standard entsprechen, werden abgelehnt. Weiterhin 
sind folgende kleine Punkte zu beachten:<p>- Die Stringlänge befindet sich bekanntermaßen 
in str[0]. Bei Portieren bereitet allerdings eine Referenz Probleme, so das grundsätzlich 
Length(str) verwendet werden sollte<BR>- Die Standard-Variable sollte den Typ 
Integer haben. Byte, Word und DWord werden nur verwendet, wenn es das Programmumfeld 
erfordert (z.b. Records). Integer ist auf einer 16 Bit Platform 2 Byte, auf einer 
32 Bit Platform 4 Byte groß und immer das <I>schnellste</I> CPU Register. Die 
Verarbeitung von Word statt Integer ist unter 32 Bit langsamer! <BR>- Bei dem 
Inline-Assembler muss darauf geachtet werden, das die Variablen SI, DI, ES ohne 
Probleme verwendet werden dürfen. Die Variable DS muss jedoch vorher gesichert 
werden.<H3>&Auml;nderungen einbringen </H3><p>Da an diesem Projekt viele Leute 
arbeiten, ist es wichtig einen einheitlichen Standard zu haben, wie neuer Code 
in die offizielle Distribution gebracht wird. Dazu wird das GNU Tool DIFF genutzt, 
welches auch auf unserem <a href="ftp://ftp.openxp.de/openxp">ftp-server</a> liegt. 
Dabei ist wichtig, das der DIFF von der letzen verf&uuml;gbaren Version erstellt 
wird, diese befindet sich ungepackt im ftp-Verzeichnis <a href="ftp://ftp.openxp.de/openxp/source">openxp/source</a>. 
Um potentiellen Problemen vorzubeigen, mu&szlig; DIFF mit der Option -u verwendet 
werden (Dank an Robo f&uuml;r diesen Hinweis). <H3>Buch-Empfehlungen </H3><p>&nbsp;<TABLE WIDTH="75%" BORDER="1"><TR><TD><A HREF="http://www.amazon.de/exec/obidos/ASIN/1556154844/openxpprojekt"><IMG SRC="1556154844_m.gif" BORDER="0"><BR> 
</A> <A HREF="http://www.amazon.de/exec/obidos/ASIN/1556154844/openxpprojekt"> 
Jetzt bestellen!</A> </TD><TD>Ein absoulter Klassiker ist Code Complete von Steve 
McConnell. Ich empfehle dieses Buch jedem, der Software entwickelt.</TD></TR><TR><TD><A HREF="http://www.amazon.de/exec/obidos/ASIN/1576104907/openxpprojekt"><IMG SRC="1576104907_l.gif" BORDER="0"><BR> 
</A> <A HREF="http://www.amazon.de/exec/obidos/ASIN/1576104907/openxpprojekt"> 
Jetzt bestellen!</A> </TD><TD><P>Dieses Buch behandelt zwei gro&szlig;e Themen: 
</P><P>1. Open Source Software: Es werden Hinweise f&uuml;r das durchf&uuml;hren 
von Open Source Projekten gegeben<BR>2. CVS: Das Versionsmanagement-System wird 
komplett bis hin zur Administration erl&auml;uftert</P></TD></TR></TABLE><p>&nbsp; <hr> 
<p><img src= 
"http://cgicounter.kundenserver.de/cgi-bin/cnt?clsid=fbd3392f1f13ed524c740ca04dec22161"> 
<a href="http://www.libranet.com/petition.html"><img src="linux.gif" width="90" 
height="30" border="0" alt="Sign The Linux Driver Petition"></a><br> 